module spider.client.dart.enums.industries;

/// 업종구분
enum Industries {
	/// 도축, 육류 가공 및 저장 처리업
	C101,
	/// 수산물 가공 및 저장 처리업
	C102,
	/// 과실, 채소 가공 및 저장 처리업
	C103, 
	/// 낙농제품 및 식용빙과류 제조업
	C105, 
	/// 곡물가공품, 전분 및 전분제품 제조업
	C106, 
	/// 기타 식품 제조업
	C107,
	/// 동물용 사료 및 조제식품 제조업
	C108, 
	/// 작물 재배업
	C011, 
	/// 알코올음료 제조업
	C111, 
	/// 비알코올음료 및 얼음 제조업
	C112, 
	/// 담배 제조업
	C120, 
	/// 방적 및 가공사 제조업
	C131, 
	/// 직물직조 및 직물제품 제조업
	C132, 
	/// 편조원단 제조업
	C133, 
	/// 기타 섬유제품 제조업
	C139, 
	/// 봉제의복 제조업
	C141, 
	/// 편조의복 제조업
	C143, 
	/// 의복 액세서리 제조업
	C144, 
	/// 가죽, 가방 및 유사제품 제조업
	C151, 
	/// 신발 및 신발 부분품 제조업
	C152, 
	/// 제재 및 목재 가공업
	C161, 
	/// 나무제품 제조업
	C162, 
	/// 펄프, 종이 및 판지 제조업
	C171, 
	/// 골판지, 종이 상자 및 종이 용기 제조업
	C172, 
	/// 기타 종이 및 판지 제품 제조업
	C179, 
	/// 인쇄 및 인쇄관련 산업
	C181, 
	/// 기록매체 복제업
	C182, 
	/// 석유 정제품 제조업
	C192, 
	/// 기초 화학물질 제조업
	C201, 
	/// 합성고무 및 플라스틱 물질 제조업
	C202, 
	/// 비료, 농약 및 살균, 살충제 제조업
	C203, 
	/// 기타 화학제품 제조업
	C204, 
	/// 화학섬유 제조업
	C205, 
	/// 기초 의약물질 및 생물학적 제제 제조업
	C211, 
	/// 의약품 제조업
	C212, 
	/// 의료용품 및 기타 의약 관련제품 제조업
	C213, 
	/// 고무제품 제조업
	C221, 
	/// 플라스틱제품 제조업
	C222, 
	/// 유리 및 유리제품 제조업
	C231, 
	/// 내화, 비내화 요업제품 제조업
	C232, 
	/// 시멘트, 석회, 플라스터 및 그 제품 제조업
	C233, 
	/// 기타 비금속 광물제품 제조업
	C239, 
	/// 1차 철강 제조업
	C241, 
	/// 1차 비철금속 제조업
	C242, 
	/// 금속 주조업
	C243, 
	/// 구조용 금속제품, 탱크 및 증기발생기 제조업
	C251, 
	/// 무기 및 총포탄 제조업
	C252, 
	/// 기타 금속 가공제품 제조업
	C259, 
	/// 반도체 제조업
	C261, 
	/// 전자부품 제조업
	C262, 
	/// 컴퓨터 및 주변장치 제조업
	C263, 
	/// 통신 및 방송 장비 제조업
	C264, 
	/// 영상 및 음향기기 제조업
	C265, 
	/// 의료용 기기 제조업
	C271, 
	/// 측정, 시험, 항해, 제어 및 기타 정밀기기 제조업; 광학기기 제외
	C272, 
	/// 사진장비 및 광학기기 제조업
	C273, 
	/// 전동기, 발전기 및 전기 변환ㆍ 공급ㆍ제어 장치 제조업
	C281, 
	/// 일차전지 및 축전지 제조업
	C282, 
	/// 절연선 및 케이블 제조업
	C283, 
	/// 전구 및 조명장치 제조업
	C284, 
	/// 가정용 기기 제조업
	C285, 
	/// 기타 전기장비 제조업
	C289, 
	/// 일반 목적용 기계 제조업
	C291, 
	/// 특수 목적용 기계 제조업
	C292, 
	/// 자동차용 엔진 및 자동차 제조업
	C301, 
	/// 자동차 신품 부품 제조업
	C303, 
	/// 자동차 재제조 부품 제조업
	C304, 
	/// 어로 어업
	C031, 
	/// 선박 및 보트 건조업
	C311, 
	/// 철도장비 제조업
	C312, 
	/// 항공기, 우주선 및 부품 제조업
	C313, 
	/// 그 외 기타 운송장비 제조업
	C319, 
	/// 가구 제조업
	C320, 
	/// 귀금속 및 장신용품 제조업
	C331, 
	/// 악기 제조업
	C332, 
	/// 운동 및 경기용구 제조업
	C333, 
	/// 그 외 기타 제품 제조업
	C339, 
	/// 전기업
	C351, 
	/// 연료용 가스 제조 및 배관공급업
	C352, 
	/// 증기, 냉ㆍ온수 및 공기조절 공급업
	C353, 
	/// 폐기물 처리업
	C382, 
	/// 환경 정화 및 복원업
	C390, 
	/// 건물 건설업
	C411, 
	/// 토목 건설업
	C412, 
	/// 기반조성 및 시설물 축조관련 전문공사업
	C421, 
	/// 건물설비 설치 공사업
	C422, 
	/// 전기 및 통신 공사업
	C423, 
	/// 실내건축 및 건축마무리 공사업
	C424, 
	/// 자동차 판매업
	C451, 
	/// 자동차 부품 및 내장품 판매업
	C452, 
	/// 상품 중개업
	C461, 
	/// 산업용 농ㆍ축산물 및 동ㆍ식물 도매업
	C462, 
	/// 음ㆍ식료품 및 담배 도매업
	C463, 
	/// 생활용품 도매업
	C464, 
	/// 기계장비 및 관련 물품 도매업
	C465, 
	/// 기타 전문 도매업
	C467, 
	/// 상품 종합 도매업
	C468, 
	/// 종합 소매업
	C471, 
	/// 음ㆍ식료품 및 담배 소매업
	C472, 
	/// 섬유, 의복, 신발 및 가죽제품 소매업
	C474, 
	/// 연료 소매업
	C477, 
	/// 기타 상품 전문 소매업
	C478, 
	/// 무점포 소매업
	C479, 
	/// 육상 여객 운송업
	C492, 
	/// 도로 화물 운송업
	C493, 
	/// 해상 운송업
	C501, 
	/// 항공 여객 운송업
	C511, 
	/// 기타 운송관련 서비스업
	C529, 
	/// 일반 및 생활 숙박시설 운영업
	C551, 
	/// 음식점업
	C561, 
	/// 서적, 잡지 및 기타 인쇄물 출판업
	C581, 
	/// 소프트웨어 개발 및 공급업
	C582, 
	/// 영화, 비디오물, 방송프로그램 제작 및 배급업
	C591, 
	/// 오디오물 출판 및 원판 녹음업
	C592, 
	/// 텔레비전 방송업
	C602, 
	/// 전기 통신업
	C612, 
	/// 컴퓨터 프로그래밍, 시스템 통합 및 관리업
	C620, 
	/// 자료처리, 호스팅, 포털 및 기타 인터넷 정보매개 서비스업
	C631, 
	/// 기타 정보 서비스업
	C639, 
	/// 신탁업 및 집합투자업
	C642, 
	/// 기타 금융업
	C649, 
	/// 금융 지원 서비스업
	C661, 
	/// 보험 및 연금관련 서비스업
	C662, 
	/// 부동산 임대 및 공급업
	C681, 
	/// 자연과학 및 공학 연구개발업
	C701, 
	/// 광고업
	C713, 
	/// 시장조사 및 여론조사업
	C714, 
	/// 회사 본부 및 경영 컨설팅 서비스업
	C715, 
	/// 기타 전문 서비스업
	C716, 
	/// 기타 비금속광물 광업
	C072, 
	/// 건축기술, 엔지니어링 및 관련 기술 서비스업
	C721, 
	/// 기타 과학기술 서비스업
	C729, 
	/// 전문 디자인업
	C732, 
	/// 그 외 기타 전문, 과학 및 기술 서비스업
	C739, 
	/// 사업시설 유지ㆍ관리 서비스업
	C741, 
	/// 여행사 및 기타 여행보조 서비스업
	C752, 
	/// 경비, 경호 및 탐정업
	C753, 
	/// 기타 사업지원 서비스업
	C759, 
	/// 운송장비 임대업
	C761, 
	/// 개인 및 가정용품 임대업
	C762, 
	/// 산업용 기계 및 장비 임대업
	C763, 
	/// 초등 교육기관
	C851, 
	/// 일반 교습 학원
	C855, 
	/// 기타 교육기관
	C856, 
	/// 교육지원 서비스업
	C857, 
	/// 창작 및 예술관련 서비스업
	C901, 
	/// 유원지 및 기타 오락관련 서비스업
	C912,
	/// 그 외 기타 개인 서비스업
	C969 
}